Tekla Open API Reference for Tekla Structures 2025
AnalysisLoadGroup.Incompatible Property
 Gets or sets a value indicating whether the load group is incompatible.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Incompatible { get; set; }
Public Property Incompatible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnalysisLoadGroup Class
Tekla.Structures.Analysis Namespace